badges([
    {   name: 'Adventure',
        imgsrc: 'images/adventure.gif',
        info: '<p>There are four things you need to do for this badge: </br> <ul> <li>Know how to prepare for a one-day expedition to the countryside. The correct clothing, footwear, food and First Aid kit are all important parts to this.</li><li>Take part in two outdoor expeditions or journeys with other Cub Scouts.</li><li>Build and light a fire or use a stove and then make a hot drink (with adults watching!)</li><li>Find your way along a route of at least one kilometre using one of these methods:<ul><li>Compass</li><li>Map</li><li>Landmark</li><li>Tracking Signs</li></ul></p>'
     },
    {
        name: 'Air Activities',
        imgsrc: 'images/air_activities.gif',
        info: '<p>There are three parts to this badge: </br><ul><li>Know the dangers involved in visiting an airfield. </li><li>Visit an aerodrome, air display or air museum. </li><li>Choose three activities from the list below: </li><ul><li>Make and fly: a model aeroplane, three different types of paper glider, a hot-air balloon, or a kite </li><li>Identify six airlines and their nationalities from their markings </li><li>Name and identify the main parts of an aeroplane </li><li>Assemble a plastic model aeroplane </li><li>Name and identify the different types of aircraft (such as powered aeroplanes, airships and gliders.) </li><li>Fly in an aircraft and share your experience with the Pack </li><li>Explain how different weather conditions can affect air activities. </li><li>Collect and identify six different pictures of aircraft and share them with other Cub Scouts. </li></ul></ul></p>'
    },
    {   name: 'Animal Carer',
        imgsrc: 'images/animal_carer.gif',
        info: '<p>There are lots of fun activities to do for this badge. You only need to choose three from the ones below:</br><ul><li>Visit a zoo or wildlife park. Find out about some of the feeding habits and natural habitats of the animals you see.</li> <li>Take care of a pet for three months and know the correct foods to give it. Be able to recognise and prevent common illnesses and know how to treat them. </li> <li>Help to care for a farm animal and know the correct food to give it. Know how to recognise common illnesses and what special care is needed before and after the birth of farm animals. </li> <li>Keep a record of bird, animal and/or insect life in their garden or local area/park. You can use pictures, sketches, photographs or tape recordings.</li> <li>Know six different freshwater, seawater or tropical fish and what types of foods they eat. </li> <li>Find out about the dangers in the countryside that threaten wildlife. Then, make a poster, collage or drawing about it or tell your Pack. </li> </ul></p>'
    },
    {   name: 'Artist',
        imgsrc: 'images/artist.gif',
        info: '<p>You can have some messy fun AND get a badge with the Art badge! Choose three of the activities listed below and make sure one of them is done in the presence of a Leader.</br><ul><li>Draw a picture of any imaginary incident, character or scene. You can use pencils, brushes, pens or crayons.</li> <li>Design and make a greetings card.</li>  <li>Make a poster advertising Cub Scouting or a Cub Scout event.</li>  <li>Make a design and print it on paper or fabric - you could use a potato with the design cut out of it.</li>  <li>Design and make a decorated book cover.</li>  <li>Draw or paint a picture of a still life or landscape. It could be outside your house or Meeting Place. A still life is a collection of items arranged on a table. This could be a vase with flowers.</li>  <li>Make a display of photographs on a subject that interests you. What about horses or Sponge Bob? </li> <li>Make a video about something that you like.</li><li>Design and build a model of something. You could also make one from clay and fire it in a kiln (only with adults!)</li><li>Visit an art gallery. </li></ul></p>'
    },
    {
        name: 'Astronomer',
        imgsrc: 'images/astronomer.gif',
        info: '<p>Complete ALL of the following:<br><ul><li>Make a model or draw a simple diagram of the solar system</li><li>Explain the difference between a planet and a star</li><li>Identify three constellations</li><li>Find out about and present some information on two of the following: planets, comets, the Northern Lights, the sun, eclipses, meteorites, black holes, the moon, light years, space exploration or any other space related subject</li><li>Look at the moon, using binoculars or a telescope if you can. Describe some of its features</li><li>Know how to find and recognise the pole star or southern star.</li><li>Know how explorers used it to find out which way to go </li></ul></p>'
    },
    {
        name: 'Book Reader',
        imgsrc: 'images/book_reader.gif',
        info: '<p>Become a bookworm with this badge. You have to complete all four of these activities:</br><ul>  <li>Make a list of at least six books you have read or used recently. Then, tell your Leader or other members of the Pack something about three of the books.</li> <li>Show that you understand how to care for your books. You could tell your Leader about how you make sure you don’t spill food or drinks on the book.</li> <li>Show that you can use a dictionary, encyclopaedia and an atlas. Perhaps get your Leader to ask you to find the spelling of a word or a country in the world.</li> <li>Explain to a Leader how the books in a library are set out and how you would find fiction and non-fiction books.</li></ul></p>'
    },
    {
        name: 'Collector',
        imgsrc: 'images/collector.gif',
        info: '<p>There are four parts to this badge that you must complete:<br><ol> <li>Start collecting something you like. These could be stamps, coins or fossils. Once you have at least 10 you will have enough for the next part of the badge requirements.</li><li>Display your collection in an exciting and interesting way. </li><li>Talk about the items in your collection, perhaps the ones that you like the most. </li><li>Visit or look at a collection made by someone else and talk to your Pack about what you liked or disliked about the presentation of it. </li></ol></p>'
    },
    {
        name: 'Cyclist',
        imgsrc: 'images/cyclist.gif',
        info: '<p>You will need to complete all eight parts to get your Cyclist Badge</br><ol><li>Own or have regular use of a bicycle of a suitable size and a cycle helmet.</li><li>Be able to mount and dismount your bike properly.</li><li>Understand the need for keeping the bike in a roadworthy condition, and how to do this.</li><li>Be able to clean and oil a bike. Show how to pump up the tyres and how to mend a puncture.</li> <li>Understand the need for keeping a bike locked when leaving it unattended. </li><li>Show knowledge of the rules and signals for cyclists from The Highway Code.</li> <li>Understand the need for lights and reflective clothing. Discuss with your Leader or other Cub Scouts the safety measures necessary for riding in poor conditions.</li></ol></p>'
    },
    {
        name: 'DIY',
        imgsrc: 'images/diy.gif',
        info: '<p>You must complete three parts to gain your DIY Badge:</br><ol><li>Show the safe use of, and how to take care of, tools such as a hammer, a saw, a screwdriver, spanners, pliers, a hand-drill, a glue gun etc. <li>Show how to prepare and paint a vertical surface with paintbrushes, roller or pad and show how to clean them. <li>Help design and make two of these items: </br><ul><li>a nesting box or window box.</li><li>a box for storing tools, pencils, tapes, etc.</li> <li>a rack for keys, mugs or coats.</li><li>book-ends or bookstand.</li> <li>a shoe rack.</li><li>noticeboard for camp.</li><li>letter holder.</li> <li>towel rail.</li></ul></p>'
    },
    {
        name: 'Entertainer',
        imgsrc: 'images/entertainer.gif',
        info: '<p>Do you like taking part in shows for your parents or school? Then why not go for your Entertainer Badge. You will need to carry out at least two of the performances listed below to achieve this badge. You can do it with other Cub Scouts or you can go solo:</br><ul><li>Help to make up a mime or play and perform it</li> <li>Perform a puppet play or shadowgraph using puppets, which you have made.</li> <li>Help to plan and make an entertainment recorded on video or audiotape.</li> <li>Sing two songs.</li> <li>Perform some folk or traditional dances.</li> <li>Make a selection of simple rhythm instruments and use them as accompaniments. <li>Take part in a gymnastic display.</li> <li>Make up and perform a dance to a piece of music of their own choice.</li> <li>Help plan and perform a series of magic tricks.</li> <li>Take part in a Gang Show, concert or band performance.</li><ul></p>'
    },
    {
        name: 'Hobbies',
        imgsrc: 'images/hobbies.gif',
        info: '<p>There are four activities to complete for the Hobbies Badge:</br><ol> <li>Show a continuing interest in your chosen hobby, interest or activity for two months.</li> <li>Show your Leader, or other Cub Scouts, how you pursue your hobby, interest or activity. Show what equipment, materials and background information they you used.</li> <li>Talk to your Leader about how you plan to develop your hobby, interest or skill in the future.</li> <li>Know the safety rules relating to the hobby (if this is necessary. Not needed for coin or toy collecting!)</li></ol></p>'
    },
    {
        name: 'Map Reader',
        imgsrc: 'images/map_reader.gif',
        info: '<p>Complete ALL of the following:</br><ul><li>Know how to use the key of an Ordnance Survey map <li>Be able to use six figure grid references <li>Explain how to find north on a map and how to set a map to north <li>Locate your home and Pack Meeting Place on an ordnance survey or street map <li>Understand contour lines on an Ordnance Survey map <li>Be able to identify 10 Ordnance Survey map symbols <li>Use an Ordnance Survey map during an outdoor activity <li>Know the eight points of a compass and use them during an outdoor activity </ul></p>'
    },
    {
        name: 'Martial Arts',
        imgsrc: 'images/martial_arts.gif',
        info: '<p>You must complete these three activities.</br><ol><li>Take part in a Martial Arts activity for at least three months and show how you are getting better.</li> <li>Discuss with a Leader the skills needed and the rules to be observed.</li><li>Take part in one exhibition or competition.</li></ol></p>'
    },
    {
        name: 'My faith',
        imgsrc: 'images/myfaith.gif',
        info: '<p>You must find out more about four of the following aspects about yout faith.</br><ul><li>Important objects at your place of worship.</li> <li>Your favourite religious songs.</li> <li>Names of people, their titles and what they do at your place of worship.</li> <li>Special festivals and customs.</li> <li>Stories from your religion. These could be from books, videos or other sources</li><li>Your favourite prayers.</li><ul></p>'
    },
    {
        name: 'Naturalist',
        imgsrc: 'images/naturalist.gif',
        info: '<p>You must complete three of these activities to get your Cub Naturalist Badge:</br><ul> <li>Make a survey of a hedgerow or wild area. Be able to identify at least six species of wild flowers, grasses or ferns.</li> <li>Keep a record of birds they have spotted over one week. Be able to identify at least six wild birds</li> <li>Make a survey of a pond, river, stream or seashore. Be able to identify some of the animals, insects or plant life they find.</li> <li>Explore the insect life of a particular area. Be able to identify some of the types of insect you find.</li> <li>Identify six different trees or shrubs from their leaves, shape, fruit or nuts and make a bark rubbing</li> <li>Identify six butterflies and/or moths and talk to a Leader about their life cycle</li></ul></p>'
    },
    {
        name: 'Physical<br>Recreation',
        imgsrc: 'images/physical_recreation.gif',
        info: '<p>You must complete these five activities to get your Physical Recreation Badge:</br><ol><li>Show a good sporting attitude in all games and sports that you take part in.</li> <li>Tell a Leader about the sports you take part in. Find out as much as you can about the sports, especially the rules.</li><li>Show reasonable skill and take part regularly in at least one of your chosen sports.</li><li>Bring along the clothing and equipment for the sport you have chosen and how to look after it.</li><li>Tell a Leader about what training and preparation you have done for the sport and when and how you practise.</li></ol></p>'
    },
    {
        name: 'Road Safety',
        imgsrc: 'images/road_safety.gif',
        info: '<p>You must complete these six activities to get your Road Safety Badge:</br><ol><li>Draw or photograph 10 different traffic signs and explain what they mean.</li><li>Show how to use the Green Cross Code.</li><li>Tell a Leader about the importance of zebra, pelican, or other crossings and know how to use them safely.</li><li>Show you know how to behave safely as a car passenger.</li><li>Show how to use a public telephone or mobile telephone and know how to make an emergency telephone call.</li><li>Make a poster to promote road safety to pedestrians.</li></ol></p>'
    },
    {
        name: 'Skater',
        imgsrc: 'images/skater.gif',
        info: '<p>There are four activities to skate your way to this badge!</br><ol><li>Own, or have used, in-line, quad or ice skates, or a skateboard for at least three months.</li><li>Know some safety rules regarding skating on a road and in other public places. Show what clothing and protective equipment (helmet, knee pads, elbow pads and so on) is appropriate to be worn for the chosen activity.</li><li>Show how to start, stop and turn safely.</li><li>Show how to fall safely and regain balance.</li></ol></p>'
    },
    {
        name: 'Sports<br>Enthusiast',
        imgsrc: 'images/sports_enthusiast.gif',
        info: '<p>There are five activities to complete to get your Sports Enthusiast Badge:</br><ol> <li>Know the rules and laws for a sport and explain them to an adult.</li><li>Have a good background knowledge of the teams and sports personalities of your chosen sport.</li><li>Explain what equipment is needed for the sport.</li><li>Be able to list some major events for your chosen sport.</li> <li>Give a description of sports events that you have attended. If this is not possible, explain to a Leader how you keep up to date with your sport.</li></ol></p>'
    },
    {
        name: 'World Faith',
        imgsrc: 'images/world_faiths.gif',
        info: '<p>You have four activities to complete for this badge:</br><ol> <li>Visit a place of worship other than your own and find out some information about the building, its contents and its form of worship.</li><li>Meet someone who belongs to a faith or denomination other than your own. Find out how they put their faith into practice.</li><li>Find out about the holy places associated with a faith other than your own.</li><li>Find out about the religious festivals and customs associated with a faith other than your own.</li></ol></p>'
    }
]);